redpencil/elasticsearch.org
* Admin
** Project management
*** Task definition                                        :v0:unbilled:
    CLOCK: [2018-10-24 18:00]--[2018-10-24 20:00] =>  2:00
** Calls
*** Initial call                                           :v0:unbilled:
   CLOCK: [2018-09-22 09:00]--[2018-09-22 10:00] =>  1:00
*** Authorization model and project definition             :v0:unbilled:
   CLOCK: [2018-10-23 22:15]--[2018-10-23 23:15] =>  1:00
* Features
** Environment
*** DONE Initial setup                                          :v0:unbilled:
    CLOCK: [2018-10-01 16:00]--[2018-10-01 18:00] =>  2:00
    CLOCK: [2018-10-02 16:00]--[2018-10-02 18:00] =>  2:00
    CLOCK: [2018-10-10 16:00]--[2018-10-10 17:30] =>  1:30
    CLOCK: [2018-10-12 16:00]--[2018-10-12 17:00] =>  1:00
** Configuration language
*** DONE Initial setup                                          :v0:unbilled:
    CLOCK: [2018-10-19 16:00]--[2018-10-19 17:30] =>  1:30
** Indexing
** Access Rights
*** DONE Initial setup                                          :v0:unbilled:
    CLOCK: [2018-10-11 16:00]--[2018-10-11 17:30] =>  1:30
    CLOCK: [2018-10-16 16:00]--[2018-10-16 19:00] =>  3:00
    CLOCK: [2018-10-17 16:00]--[2018-10-17 17:30] =>  1:30
    CLOCK: [2018-10-18 16:00]--[2018-10-18 18:00] =>  2:00
*** TODO Store and lookup indexes in memory                              :v1:
    serialize in triplestore
*** TODO Basic Model                                                     :v1:
    ALLOWED_GROUPS must be a superset, USED_GROUPS a subset
** JSON-API compliant requests (search language)
*** TODO Correct LINKS                                                   :v1:
*** TODO Multi-field search                                              :v1:
    same as ?q=a+query
*** TODO All simple search methods                                       :v1:
