redpencil/elasticsearch.org
*** TODO Terms and term sets                                             :v1:
*** TODO Fuzzy search                                                    :v1:
*** TODO Ranges                                                          :v1:
*** TODO Other parameters                                                :v1:
    boost, etc.
** JSON-API compliant response
*** DONE Initial setup                                          :v0:unbilled:
    CLOCK: [2018-10-22 16:00]--[2018-10-22 18:00] =>  2:00
    CLOCK: [2018-10-23 16:00]--[2018-10-23 18:00] =>  2:00
*** TODO Valid JSON-API for raw Elasticsearch DSL endpoint
    Get from and size from the query, calculate pagination
** Querying multiple types
*** TODO Configurable endpoints for multiple types                       :v1:
*** TODO JSON-API formatted response                                     :v1:
** Eager indexing
*** TODO Build indexes on boot-up based on configured group-sets         :v1:
*** TODO Scan index to build a configuration which indicates the MU_AUTH_ALLOWED_GROUPS to be scanned per index :v1:
    (some search indexes may have different MU_AUTH_ALLOWED_GROUPS).
*** TODO Discover when the SPARQL endpoint is ‘up’                       :v1:
    so you can wait if your microservice boots up quicker than Virtuoso and/or mu-authorization.
*** TODO Build a fresh index once everything has been booted up correctly :v1:
    Note that you may start receiving Deltas at the same time, so you may want to hold off for a moment when starting to build the first indexes.
*** TODO Store the status of your microservice in the triplestore        :v1:
    Waiting to index
    Indexing
    Finished indexing

** Automatic index invalidation
*** Automatically calculate the index when no index exists
*** Configuration language
    Define a configuration language to indicate which fields (or paths) need to be indexed (this replaces the earlier SPARQL query)
*** Subscribe to updates from the Delta service, in order to update the indexes
*** Invalidate the index when destructive updates arrive
*** Automatically recalculate the index, when an invalidated index exists
** Automatic index updating
*** Create feature flag to choose between updating the index, and clearing the index
*** Build a mapping language from the Delta Input which caused invalidation, to logic which identifies the applicable update
*** Apply the updates as input arrives
** Stored indexes
*** TODO Store indexes on disk                                           :v1:
*** Consume deltas on booting up to ensure indexes are correct
*** TODO Endpoint for resetting stored indexes, and documentation        :v1:
** Monitor configuration
*** Detect when the config files change
*** Destroy all indexes on changes
*** Rebuild the necessary indexes
*** Ensure indexes may be lazy-loaded during development
** Eager indexing from the semantic model
*** Allow the user to construct the configuration for MU_AUTH_ALLOWED_GROUPS with a SPARQL query
*** Allow the user to construct the configuration which defines which Deltas trigger recalculating the MU_AUTH_ALLOWED_GROUPS configuration function
*** Update the indexes only when the resulting MU_AUTH_ALLOWED_GROUPS have changed

* Reporting
** Milestones
