public/elasticsearch.html
<div id="outline-container-sec-2-5-4" class="outline-4">
<h4 id="sec-2-5-4"><span class="section-number-4">2.5.4</span> <span class="todo TODO">TODO</span> Terms and term sets&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
<div id="outline-container-sec-2-5-5" class="outline-4">
<h4 id="sec-2-5-5"><span class="section-number-4">2.5.5</span> <span class="todo TODO">TODO</span> Fuzzy search&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
<div id="outline-container-sec-2-5-6" class="outline-4">
<h4 id="sec-2-5-6"><span class="section-number-4">2.5.6</span> <span class="todo TODO">TODO</span> Ranges&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
<div id="outline-container-sec-2-5-7" class="outline-4">
<h4 id="sec-2-5-7"><span class="section-number-4">2.5.7</span> <span class="todo TODO">TODO</span> Other parameters&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
<div class="outline-text-4" id="text-2-5-7">
<p>
boost, etc.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> JSON-API compliant response</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> <span class="done DONE">DONE</span> Initial setup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v0">v0</span>&#xa0;<span class="unbilled">unbilled</span></span></h4>
<div class="outline-text-4" id="text-2-6-1">
</div>
</div>
<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> <span class="todo TODO">TODO</span> Valid JSON-API for raw Elasticsearch DSL endpoint</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Get from and size from the query, calculate pagination
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Querying multiple types</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> <span class="todo TODO">TODO</span> Configurable endpoints for multiple types&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
<div id="outline-container-sec-2-7-2" class="outline-4">
<h4 id="sec-2-7-2"><span class="section-number-4">2.7.2</span> <span class="todo TODO">TODO</span> JSON-API formatted response&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Eager indexing</h3>
<div class="outline-text-3" id="text-2-8">
</div><div id="outline-container-sec-2-8-1" class="outline-4">
<h4 id="sec-2-8-1"><span class="section-number-4">2.8.1</span> <span class="todo TODO">TODO</span> Build indexes on boot-up based on configured group-sets&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
<div id="outline-container-sec-2-8-2" class="outline-4">
<h4 id="sec-2-8-2"><span class="section-number-4">2.8.2</span> <span class="todo TODO">TODO</span> Scan index to build a configuration which indicates the MU<sub>AUTH</sub><sub>ALLOWED</sub><sub>GROUPS</sub> to be scanned per index&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
(some search indexes may have different MU<sub>AUTH</sub><sub>ALLOWED</sub><sub>GROUPS</sub>).
</p>
</div>
</div>
<div id="outline-container-sec-2-8-3" class="outline-4">
<h4 id="sec-2-8-3"><span class="section-number-4">2.8.3</span> <span class="todo TODO">TODO</span> Discover when the SPARQL endpoint is ‘up’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
<div class="outline-text-4" id="text-2-8-3">
<p>
so you can wait if your microservice boots up quicker than Virtuoso and/or mu-authorization.
</p>
</div>
</div>
<div id="outline-container-sec-2-8-4" class="outline-4">
<h4 id="sec-2-8-4"><span class="section-number-4">2.8.4</span> <span class="todo TODO">TODO</span> Build a fresh index once everything has been booted up correctly&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
<div class="outline-text-4" id="text-2-8-4">
<p>
Note that you may start receiving Deltas at the same time, so you may want to hold off for a moment when starting to build the first indexes.
</p>
</div>
</div>
<div id="outline-container-sec-2-8-5" class="outline-4">
<h4 id="sec-2-8-5"><span class="section-number-4">2.8.5</span> <span class="todo TODO">TODO</span> Store the status of your microservice in the triplestore&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
<div class="outline-text-4" id="text-2-8-5">
<p>
Waiting to index
Indexing
Finished indexing
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Automatic index invalidation</h3>
<div class="outline-text-3" id="text-2-9">
</div><div id="outline-container-sec-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> Automatically calculate the index when no index exists</h4>
</div>
<div id="outline-container-sec-2-9-2" class="outline-4">
<h4 id="sec-2-9-2"><span class="section-number-4">2.9.2</span> Configuration language</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
Define a configuration language to indicate which fields (or paths) need to be indexed (this replaces the earlier SPARQL query)
</p>
</div>
</div>
<div id="outline-container-sec-2-9-3" class="outline-4">
<h4 id="sec-2-9-3"><span class="section-number-4">2.9.3</span> Subscribe to updates from the Delta service, in order to update the indexes</h4>
</div>
<div id="outline-container-sec-2-9-4" class="outline-4">
<h4 id="sec-2-9-4"><span class="section-number-4">2.9.4</span> Invalidate the index when destructive updates arrive</h4>
</div>
<div id="outline-container-sec-2-9-5" class="outline-4">
<h4 id="sec-2-9-5"><span class="section-number-4">2.9.5</span> Automatically recalculate the index, when an invalidated index exists</h4>
</div>
</div>
<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Automatic index updating</h3>
<div class="outline-text-3" id="text-2-10">
</div><div id="outline-container-sec-2-10-1" class="outline-4">
<h4 id="sec-2-10-1"><span class="section-number-4">2.10.1</span> Create feature flag to choose between updating the index, and clearing the index</h4>
</div>
<div id="outline-container-sec-2-10-2" class="outline-4">
<h4 id="sec-2-10-2"><span class="section-number-4">2.10.2</span> Build a mapping language from the Delta Input which caused invalidation, to logic which identifies the applicable update</h4>
</div>
<div id="outline-container-sec-2-10-3" class="outline-4">
<h4 id="sec-2-10-3"><span class="section-number-4">2.10.3</span> Apply the updates as input arrives</h4>
</div>
</div>
<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> Stored indexes</h3>
<div class="outline-text-3" id="text-2-11">
</div><div id="outline-container-sec-2-11-1" class="outline-4">
<h4 id="sec-2-11-1"><span class="section-number-4">2.11.1</span> <span class="todo TODO">TODO</span> Store indexes on disk&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
<div id="outline-container-sec-2-11-2" class="outline-4">
<h4 id="sec-2-11-2"><span class="section-number-4">2.11.2</span> Consume deltas on booting up to ensure indexes are correct</h4>
</div>
<div id="outline-container-sec-2-11-3" class="outline-4">
<h4 id="sec-2-11-3"><span class="section-number-4">2.11.3</span> <span class="todo TODO">TODO</span> Endpoint for resetting stored indexes, and documentation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="v1">v1</span></span></h4>
</div>
</div>
<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> Monitor configuration</h3>
<div class="outline-text-3" id="text-2-12">
</div><div id="outline-container-sec-2-12-1" class="outline-4">
<h4 id="sec-2-12-1"><span class="section-number-4">2.12.1</span> Detect when the config files change</h4>
</div>
<div id="outline-container-sec-2-12-2" class="outline-4">
<h4 id="sec-2-12-2"><span class="section-number-4">2.12.2</span> Destroy all indexes on changes</h4>
</div>
<div id="outline-container-sec-2-12-3" class="outline-4">
<h4 id="sec-2-12-3"><span class="section-number-4">2.12.3</span> Rebuild the necessary indexes</h4>
</div>
<div id="outline-container-sec-2-12-4" class="outline-4">
<h4 id="sec-2-12-4"><span class="section-number-4">2.12.4</span> Ensure indexes may be lazy-loaded during development</h4>
</div>
</div>
<div id="outline-container-sec-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> Eager indexing from the semantic model</h3>
<div class="outline-text-3" id="text-2-13">
</div><div id="outline-container-sec-2-13-1" class="outline-4">
<h4 id="sec-2-13-1"><span class="section-number-4">2.13.1</span> Allow the user to construct the configuration for MU<sub>AUTH</sub><sub>ALLOWED</sub><sub>GROUPS</sub> with a SPARQL query</h4>
</div>
<div id="outline-container-sec-2-13-2" class="outline-4">
<h4 id="sec-2-13-2"><span class="section-number-4">2.13.2</span> Allow the user to construct the configuration which defines which Deltas trigger recalculating the MU<sub>AUTH</sub><sub>ALLOWED</sub><sub>GROUPS</sub> configuration function</h4>
</div>
<div id="outline-container-sec-2-13-3" class="outline-4">
<h4 id="sec-2-13-3"><span class="section-number-4">2.13.3</span> Update the indexes only when the resulting MU<sub>AUTH</sub><sub>ALLOWED</sub><sub>GROUPS</sub> have changed</h4>
</div>
</div>
</div>
