redpencil/elasticsearch.org
*** v0
#+BEGIN: clocktable :maxlevel 2 :scope file :tags "v0"
#+CAPTION: Clock summary at [2018-10-24 mer. 19:43]
| Headline                          |      Time |      |
|-----------------------------------+-----------+------|
| *Total time*                      | *1d 0:00* |      |
|-----------------------------------+-----------+------|
| Admin                             |      4:00 |      |
| \emsp Project management          |           | 2:00 |
| \emsp Calls                       |           | 2:00 |
| Features                          |     20:00 |      |
| \emsp Environment                 |           | 6:30 |
| \emsp Configuration language      |           | 1:30 |
| \emsp Access Rights               |           | 8:00 |
| \emsp JSON-API compliant response |           | 4:00 |
#+END:
*** v1
#+BEGIN: clocktable :maxlevel 2 :scope file :tags "v1"
#+CAPTION: Clock summary at [2018-10-24 mer. 19:45]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |
#+END:
** Invoices
*** Invoice 1
#+BEGIN: clocktable :maxlevel 2 :scope file :tags "unbilled&v0"
#+CAPTION: Clock summary at [2018-10-24 mer. 19:44]
| Headline                          |      Time |      |
|-----------------------------------+-----------+------|
| *Total time*                      | *1d 0:00* |      |
|-----------------------------------+-----------+------|
| Admin                             |      4:00 |      |
| \emsp Project management          |           | 2:00 |
| \emsp Calls                       |           | 2:00 |
| Features                          |     20:00 |      |
| \emsp Environment                 |           | 6:30 |
| \emsp Configuration language      |           | 1:30 |
| \emsp Access Rights               |           | 8:00 |
| \emsp JSON-API compliant response |           | 4:00 |
#+END:
